# WorksetPreview Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetPreview Properties
WorksetPreview Class See Also
---
The WorksetPreview type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | Id of the workset. |
| IsDefaultWorkset | Whether the workset is the default one. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | Name of the workset. |
| Owner | User name of the workset. |
| UniqueId | UniqueId of the workset. |

# See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace